smagorinsky/sampleSetup_Smag_r180_v2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  3.0.1                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
 {
	 version	 2.0;
 	 format	 ascii;
	 class	 dictionary;
	 object	 blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1; 

/*     Back o------------------
                              |
                              o

         	       . 13-------------12
         	     .	 11		10
          	   .	  9		8
          	 .	  7 - - - - - - 6
               .	  5 		4
             .		  3		2
           .		  0-------------1
         .                            .
       .                            .
     .                            . 
   .                            .
  26-------------27           .
  24		 25         . 
  22  		 23       . 
  20 - - - - - - 21     .
  18		 19   .
  16		 17 .
  14-------------15

        o
        |
        --------------------o FRONT

   
    y ^
      |
      o ---> x
     /
   z 

*/



vertices
(
    (0 		0 		0)	// 0
    (9.0 	0 		0)	// 1
    (9.0 	0.027777 	0)	// 2
    (0		0.027777 	0)	// 3
    (9.0 	0.2     	0)	// 4
    (0 		0.2     	0)	// 5
    (9.0 	1.0 		0)	// 6
    (0 		1.0 		0)	// 7
    (9.0	1.8      	0)	// 8
    (0 		1.8     	0)	// 9
    (9.0 	1.972223 	0)	// 10
    (0 		1.972223 	0)	// 11
    (9.0 	2.0 		0)	// 12
    (0 		2.0 		0)	// 13
    (0 		0 		4.0)	// 14
    (9.0 	0 		4.0)	// 15
    (9.0 	0.027777 	4.0)	// 16
    (0 		0.027777	4.0)	// 17
    (9.0 	0.2     	4.0)	// 18
    (0 		0.2     	4.0)	// 19
    (9.0 	1.0 		4.0)	// 20
    (0 		1.0 		4.0)	// 21
    (9.0 	1.8     	4.0)	// 22
    (0 		1.8     	4.0)	// 23
    (9.0 	1.972223 	4.0)	// 24
    (0 		1.972223 	4.0)	// 25
    (9.0 	2.0 		4.0)	// 26
    (0 		2.0 		4.0)	// 27
);

blocks
(
    hex (0  1  2  3  14  15  16  17) (130 5  80) SimpleGrading (1  1        	      1) // bottom: viscous sub-layer 
    hex (3  2  4  5  17  16  18  19) (130 13 80) SimpleGrading (1  4.500126004 	      1) // bottom: log-law region
    hex (5  4  6  7  19  18  20  21) (130 32 80) SimpleGrading (1  1	              1) // bottom: outer layer (till core)
    hex (7  6  8  9  21  20  22  23) (130 32 80) SimpleGrading (1  1 		      1) // top:    outer later (till core)
    hex (9  8  10 11 23  22  24  25) (130 13 80) SimpleGrading (1  0.2222159999766975 1) // top:    log-law region
    hex (11 10 12 13 25  24  26  27) (130 5  80) SimpleGrading (1  1        	      1) // top:    viscous sub-layer
);

edges
(
);

boundary
(
   inlet
   {
       type 		cyclic;
       neighbourPatch   outlet;
       faces
       (
            (0 3 17 14)
            (3 5 19 17)
            (5 7 21 19)
            (7 9 23 21)
            (9 11 25 23)
            (11 13 27 25)
       );
   }
   outlet
   {
       type 		cyclic;
       neighbourPatch   inlet;
       faces
       (
            (2 1 15 16)
            (4 2 16 18)
            (6 4 18 20)
            (8 6 20 22)
            (10 8 22 24)
            (12 10 24 26)
       );
   }
   bottomWall
   {
       type 		wall;
       faces
       (
            (1 0 14 15)
       );
   }
   topWall
   {
       type 		wall;
       faces
       (
            (13 12 26 27)
       );
   }
   left
   {
       type 		cyclic;
       neighbourPatch   right;
       faces
       (
            (0 1 2 3)
            (3 2 4 5)
            (5 4 6 7)
            (7 6 8 9)
            (9 8 10 11)
            (11 10 12 13)
       );
   }
   right
   {
       type 		cyclic;
       neighbourPatch   left;
       faces
       (
            (14 15 16 17)
            (17 16 18 19)
            (19 18 20 21)
            (21 20 22 23)
            (23 22 24 25)
            (25 24 26 27)
       );
   }
);

mergePatchPairs
(
);

// ************************************************************************* //
